*********************************************************************************************************
Query to find the names of all primarysites 
*********************************************************************************************************

PREFIX csiro: <http://network.csiro.au/data/csiro/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX gn: <http://www.geonames.org/ontology#>
PREFIX locn: <http://www.w3.org/ns/locn#>
PREFIX org: <http://www.w3.org/ns/org#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX prov: <http://www.w3.org/ns/prov#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX wgs: <http://www.w3.org/2003/01/geo/wgs84_pos#>
PREFIX xml: <http://www.w3.org/XML/1998/namespace>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

SELECT DISTINCT ?y
WHERE{
    ?x org:hasPrimarySite ?y
}
**********************************************************************************************************
Result:
http://network.csiro.au/data/csiro/Armidale
http://network.csiro.au/data/csiro/AustralianCapitalTerritory
http://network.csiro.au/data/csiro/Barton
http://network.csiro.au/data/csiro/CannonHill
http://network.csiro.au/data/csiro/Chippendale
http://network.csiro.au/data/csiro/ClaytonandLucasHeights
http://network.csiro.au/data/csiro/Coogee
http://network.csiro.au/data/csiro/Deniliquin
http://network.csiro.au/data/csiro/EastGeelong
http://network.csiro.au/data/csiro/Epping
http://network.csiro.au/data/csiro/Fitzroy
http://network.csiro.au/data/csiro/GlenOsmond
http://network.csiro.au/data/csiro/Homebush
http://network.csiro.au/data/csiro/Lindfield
http://network.csiro.au/data/csiro/Lyneham
http://network.csiro.au/data/csiro/MelbourneandCanberra
http://network.csiro.au/data/csiro/NewSouthWales
http://network.csiro.au/data/csiro/Parkes
http://network.csiro.au/data/csiro/Rockhampton
http://network.csiro.au/data/csiro/Rocklea
http://network.csiro.au/data/csiro/StLucia
http://network.csiro.au/data/csiro/Urrbrae
http://network.csiro.au/data/csiro/WesternAustralia
http://network.csiro.au/data/csiro/Blacktown
http://network.csiro.au/data/csiro/Glebe
http://network.csiro.au/data/csiro/Marbein
http://network.csiro.au/data/csiro/PortMelbourne
http://network.csiro.au/data/csiro/Prospect
http://network.csiro.au/data/csiro/SouthMelbourne
http://network.csiro.au/data/csiro/UniversityofAdelaide
http://network.csiro.au/data/csiro/LucasHeights
http://network.csiro.au/data/csiro/Australia
http://network.csiro.au/data/csiro/Melbourne
http://network.csiro.au/data/csiro/BlackMountain
http://network.csiro.au/data/csiro/Maribyrnong
http://network.csiro.au/data/csiro/Marsfield
http://network.csiro.au/data/csiro/Aspendale
http://network.csiro.au/data/csiro/Belmont
http://network.csiro.au/data/csiro/Cronulla
http://network.csiro.au/data/csiro/Geelong
http://network.csiro.au/data/csiro/Parkville
http://network.csiro.au/data/csiro/FishermansBend
http://network.csiro.au/data/csiro/Ryde
http://network.csiro.au/data/csiro/Canberra
http://network.csiro.au/data/csiro/NorthRyde
http://network.csiro.au/data/csiro/Sydney
http://network.csiro.au/data/csiro/Griffith
http://network.csiro.au/data/csiro/FloreatPark
http://network.csiro.au/data/csiro/Syndal
http://network.csiro.au/data/csiro/Victoria
http://network.csiro.au/data/csiro/Clayton
http://network.csiro.au/data/csiro/Hobart
http://network.csiro.au/data/csiro/Highett
http://network.csiro.au/data/csiro/Yarralumla
http://network.csiro.au/data/csiro/Adelaide
http://network.csiro.au/data/csiro/Campbell

***********************************************************************************************************
Qery to count number of primary sites across Australia
***********************************************************************************************************
PREFIX csiro: <http://network.csiro.au/data/csiro/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX gn: <http://www.geonames.org/ontology#>
PREFIX locn: <http://www.w3.org/ns/locn#>
PREFIX org: <http://www.w3.org/ns/org#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX prov: <http://www.w3.org/ns/prov#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX wgs: <http://www.w3.org/2003/01/geo/wgs84_pos#>
PREFIX xml: <http://www.w3.org/XML/1998/namespace>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

SELECT (COUNT(DISTINCT ?y) AS ?NoofPrimarysites)
WHERE{
    ?x org:hasPrimarySite ?y.
}

****************************************************
Result:
56
****************************************************
